Revit 2026 API
DeleteElements.Create Method
Overload List
Name | Description
Create(Document, ElementId) |  Creates an instance of the DeleteElements resolution.
Create(Document, IList<ElementId>)
Create(Document, ISet<ElementId>)
Top
See Also
Reference
DeleteElements Class
Autodesk.Revit.DB Namespace